#+Title: District-level male medical and traditional circumcision
#+Title: coverage and unmet need in sub-Saharan Africa
#+date: 17th October 2022
#+bibliography: library.bib 
#+options: toc:nil num:t d:nil author:nil
#+startup: latexpreview

# Load latex class, define page and text size
#+latex_class: article
#+latex_class_options: [a4paper, 12pt]

# load latex packages
#+latex_header: \usepackage{authblk} 
#+latex_header: \usepackage{breakcites}
#+latex_header: \usepackage{apacite}
#+latex_header: \usepackage[top=3cm, bottom=3cm, left=3cm, right=3cm]{geometry} % define (reduced) margin size
#+latex_header: \usepackage[parfill]{parskip} % insert whitespace between new paragraphs

# Don't indent new paragraphs
#+latex_header: \setlength\parindent{0pt} 

# Don't hyponate words, instead break line
#+latex_header: \tolerance=9999
#+latex_header: \emergencystretch=10pt
#+latex_header: \hyphenpenalty=10000
#+latex_header: \exhyphenpenalty=100

* R & Emacs Lisp                                            :noexport:ignore:

#+name: setwd
#+begin_src R :results output :session :exports results
# set directory to top of git repo (assume paper_poster_plots in threemc-orderly)
# dir <- dirname(system("git rev-parse --show-toplevel", intern = TRUE))
dir <- "~/imperial_repos/threemc-orderly/"
setwd(dir)
#+end_src

#+RESULTS: setwd
: [1] "/home/paddy7wb/imperial_repos/threemc-orderly"

